# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Cross-shell prompt for astronauts
brew "starship"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Desktop password and login vault
cask "bitwarden"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inter"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
